# NewAreaTag Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..NewAreaTag Method
Document Class See Also
---
Creates a new area tag.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaTag NewAreaTag(
	ViewPlan areaView,
	Area room,
	UV point
)
```

Visual Basic
---
```text
Public Function NewAreaTag ( _
	areaView As ViewPlan, _
	room As Area, _
	point As UV _
) As AreaTag
```

Visual C++
---
```text
public:
AreaTag^ NewAreaTag(
	ViewPlan^ areaView,
	Area^ room,
	UV^ point
)
```

# ### Parameters
areaView
    Type: Autodesk.Revit.DB..::..ViewPlanThe area view
room
    Type: Autodesk.Revit.DB..::..AreaThe area to tag
point
    Type: Autodesk.Revit.DB..::..UVThe position of the area tag
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the area view does not exist in the given document. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown if the area does not exist in the given document. |

# See Also
Document Class
Autodesk.Revit.Creation Namespace